HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxDma_reg.h
/** \brief 1AF8, DMA Channel 62 Suspend Enable Register */
#define DMA_SUSENR62 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AF8u)
/** Alias (User Manual Name) for DMA_SUSENR62.
* To use register names with standard convension, please use DMA_SUSENR62.
*/
#define DMA_SUSENR062 (DMA_SUSENR62)

/** \brief 1AFC, DMA Channel 63 Suspend Enable Register */
#define DMA_SUSENR63 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AFCu)
/** Alias (User Manual Name) for DMA_SUSENR63.
* To use register names with standard convension, please use DMA_SUSENR63.
*/
#define DMA_SUSENR063 (DMA_SUSENR63)

/** \brief 1B00, DMA Channel 64 Suspend Enable Register */
#define DMA_SUSENR64 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B00u)
/** Alias (User Manual Name) for DMA_SUSENR64.
* To use register names with standard convension, please use DMA_SUSENR64.
*/
#define DMA_SUSENR064 (DMA_SUSENR64)

/** \brief 1B04, DMA Channel 65 Suspend Enable Register */
#define DMA_SUSENR65 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B04u)
/** Alias (User Manual Name) for DMA_SUSENR65.
* To use register names with standard convension, please use DMA_SUSENR65.
*/
#define DMA_SUSENR065 (DMA_SUSENR65)

/** \brief 1B08, DMA Channel 66 Suspend Enable Register */
#define DMA_SUSENR66 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B08u)
/** Alias (User Manual Name) for DMA_SUSENR66.
* To use register names with standard convension, please use DMA_SUSENR66.
*/
#define DMA_SUSENR066 (DMA_SUSENR66)

/** \brief 1B0C, DMA Channel 67 Suspend Enable Register */
#define DMA_SUSENR67 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B0Cu)
/** Alias (User Manual Name) for DMA_SUSENR67.
* To use register names with standard convension, please use DMA_SUSENR67.
*/
#define DMA_SUSENR067 (DMA_SUSENR67)

/** \brief 1B10, DMA Channel 68 Suspend Enable Register */
#define DMA_SUSENR68 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B10u)
/** Alias (User Manual Name) for DMA_SUSENR68.
* To use register names with standard convension, please use DMA_SUSENR68.
*/
#define DMA_SUSENR068 (DMA_SUSENR68)

/** \brief 1B14, DMA Channel 69 Suspend Enable Register */
#define DMA_SUSENR69 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B14u)
/** Alias (User Manual Name) for DMA_SUSENR69.
* To use register names with standard convension, please use DMA_SUSENR69.
*/
#define DMA_SUSENR069 (DMA_SUSENR69)

/** \brief 1B18, DMA Channel 70 Suspend Enable Register */
#define DMA_SUSENR70 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B18u)
/** Alias (User Manual Name) for DMA_SUSENR70.
* To use register names with standard convension, please use DMA_SUSENR70.
*/
#define DMA_SUSENR070 (DMA_SUSENR70)

/** \brief 1B1C, DMA Channel 71 Suspend Enable Register */
#define DMA_SUSENR71 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B1Cu)
/** Alias (User Manual Name) for DMA_SUSENR71.
* To use register names with standard convension, please use DMA_SUSENR71.
*/
#define DMA_SUSENR071 (DMA_SUSENR71)

/** \brief 1B20, DMA Channel 72 Suspend Enable Register */
#define DMA_SUSENR72 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B20u)
/** Alias (User Manual Name) for DMA_SUSENR72.
* To use register names with standard convension, please use DMA_SUSENR72.
*/
#define DMA_SUSENR072 (DMA_SUSENR72)

/** \brief 1B24, DMA Channel 73 Suspend Enable Register */
#define DMA_SUSENR73 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B24u)
/** Alias (User Manual Name) for DMA_SUSENR73.
* To use register names with standard convension, please use DMA_SUSENR73.
*/
#define DMA_SUSENR073 (DMA_SUSENR73)

/** \brief 1B28, DMA Channel 74 Suspend Enable Register */
#define DMA_SUSENR74 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B28u)
/** Alias (User Manual Name) for DMA_SUSENR74.
* To use register names with standard convension, please use DMA_SUSENR74.
*/
#define DMA_SUSENR074 (DMA_SUSENR74)

/** \brief 1B2C, DMA Channel 75 Suspend Enable Register */
#define DMA_SUSENR75 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B2Cu)
/** Alias (User Manual Name) for DMA_SUSENR75.
* To use register names with standard convension, please use DMA_SUSENR75.
*/
#define DMA_SUSENR075 (DMA_SUSENR75)

/** \brief 1B30, DMA Channel 76 Suspend Enable Register */
#define DMA_SUSENR76 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B30u)
/** Alias (User Manual Name) for DMA_SUSENR76.
* To use register names with standard convension, please use DMA_SUSENR76.
*/
#define DMA_SUSENR076 (DMA_SUSENR76)

/** \brief 1B34, DMA Channel 77 Suspend Enable Register */
#define DMA_SUSENR77 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B34u)
/** Alias (User Manual Name) for DMA_SUSENR77.
* To use register names with standard convension, please use DMA_SUSENR77.
*/
#define DMA_SUSENR077 (DMA_SUSENR77)

/** \brief 1B38, DMA Channel 78 Suspend Enable Register */
#define DMA_SUSENR78 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B38u)
/** Alias (User Manual Name) for DMA_SUSENR78.
* To use register names with standard convension, please use DMA_SUSENR78.
*/
#define DMA_SUSENR078 (DMA_SUSENR78)

/** \brief 1B3C, DMA Channel 79 Suspend Enable Register */
#define DMA_SUSENR79 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B3Cu)
/** Alias (User Manual Name) for DMA_SUSENR79.
* To use register names with standard convension, please use DMA_SUSENR79.
*/
#define DMA_SUSENR079 (DMA_SUSENR79)

/** \brief 1B40, DMA Channel 80 Suspend Enable Register */
#define DMA_SUSENR80 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B40u)
/** Alias (User Manual Name) for DMA_SUSENR80.
* To use register names with standard convension, please use DMA_SUSENR80.
*/
#define DMA_SUSENR080 (DMA_SUSENR80)

/** \brief 1B44, DMA Channel 81 Suspend Enable Register */
#define DMA_SUSENR81 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B44u)
/** Alias (User Manual Name) for DMA_SUSENR81.
* To use register names with standard convension, please use DMA_SUSENR81.
*/
#define DMA_SUSENR081 (DMA_SUSENR81)

/** \brief 1B48, DMA Channel 82 Suspend Enable Register */
#define DMA_SUSENR82 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B48u)
/** Alias (User Manual Name) for DMA_SUSENR82.
* To use register names with standard convension, please use DMA_SUSENR82.
*/
#define DMA_SUSENR082 (DMA_SUSENR82)

/** \brief 1B4C, DMA Channel 83 Suspend Enable Register */
#define DMA_SUSENR83 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B4Cu)
/** Alias (User Manual Name) for DMA_SUSENR83.
* To use register names with standard convension, please use DMA_SUSENR83.
*/
#define DMA_SUSENR083 (DMA_SUSENR83)

/** \brief 1B50, DMA Channel 84 Suspend Enable Register */
#define DMA_SUSENR84 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B50u)
/** Alias (User Manual Name) for DMA_SUSENR84.
* To use register names with standard convension, please use DMA_SUSENR84.
*/
#define DMA_SUSENR084 (DMA_SUSENR84)

/** \brief 1B54, DMA Channel 85 Suspend Enable Register */
#define DMA_SUSENR85 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B54u)
/** Alias (User Manual Name) for DMA_SUSENR85.
* To use register names with standard convension, please use DMA_SUSENR85.
*/
#define DMA_SUSENR085 (DMA_SUSENR85)

/** \brief 1B58, DMA Channel 86 Suspend Enable Register */
#define DMA_SUSENR86 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B58u)
/** Alias (User Manual Name) for DMA_SUSENR86.
* To use register names with standard convension, please use DMA_SUSENR86.
*/
#define DMA_SUSENR086 (DMA_SUSENR86)

/** \brief 1B5C, DMA Channel 87 Suspend Enable Register */
#define DMA_SUSENR87 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B5Cu)
/** Alias (User Manual Name) for DMA_SUSENR87.
* To use register names with standard convension, please use DMA_SUSENR87.
*/
#define DMA_SUSENR087 (DMA_SUSENR87)

/** \brief 1B60, DMA Channel 88 Suspend Enable Register */
#define DMA_SUSENR88 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B60u)
/** Alias (User Manual Name) for DMA_SUSENR88.
* To use register names with standard convension, please use DMA_SUSENR88.
*/
#define DMA_SUSENR088 (DMA_SUSENR88)

/** \brief 1B64, DMA Channel 89 Suspend Enable Register */
#define DMA_SUSENR89 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B64u)
/** Alias (User Manual Name) for DMA_SUSENR89.
* To use register names with standard convension, please use DMA_SUSENR89.
*/
#define DMA_SUSENR089 (DMA_SUSENR89)

/** \brief 1B68, DMA Channel 90 Suspend Enable Register */
#define DMA_SUSENR90 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B68u)
/** Alias (User Manual Name) for DMA_SUSENR90.
* To use register names with standard convension, please use DMA_SUSENR90.
*/
#define DMA_SUSENR090 (DMA_SUSENR90)

/** \brief 1B6C, DMA Channel 91 Suspend Enable Register */
#define DMA_SUSENR91 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B6Cu)
/** Alias (User Manual Name) for DMA_SUSENR91.
* To use register names with standard convension, please use DMA_SUSENR91.
*/
#define DMA_SUSENR091 (DMA_SUSENR91)

/** \brief 1B70, DMA Channel 92 Suspend Enable Register */
#define DMA_SUSENR92 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B70u)
/** Alias (User Manual Name) for DMA_SUSENR92.
* To use register names with standard convension, please use DMA_SUSENR92.
*/
#define DMA_SUSENR092 (DMA_SUSENR92)

