HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxDma_reg.h
/** \brief 1B74, DMA Channel 93 Suspend Enable Register */
#define DMA_SUSENR93 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B74u)
/** Alias (User Manual Name) for DMA_SUSENR93.
* To use register names with standard convension, please use DMA_SUSENR93.
*/
#define DMA_SUSENR093 (DMA_SUSENR93)

/** \brief 1B78, DMA Channel 94 Suspend Enable Register */
#define DMA_SUSENR94 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B78u)
/** Alias (User Manual Name) for DMA_SUSENR94.
* To use register names with standard convension, please use DMA_SUSENR94.
*/
#define DMA_SUSENR094 (DMA_SUSENR94)

/** \brief 1B7C, DMA Channel 95 Suspend Enable Register */
#define DMA_SUSENR95 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B7Cu)
/** Alias (User Manual Name) for DMA_SUSENR95.
* To use register names with standard convension, please use DMA_SUSENR95.
*/
#define DMA_SUSENR095 (DMA_SUSENR95)

/** \brief 1B80, DMA Channel 96 Suspend Enable Register */
#define DMA_SUSENR96 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B80u)
/** Alias (User Manual Name) for DMA_SUSENR96.
* To use register names with standard convension, please use DMA_SUSENR96.
*/
#define DMA_SUSENR096 (DMA_SUSENR96)

/** \brief 1B84, DMA Channel 97 Suspend Enable Register */
#define DMA_SUSENR97 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B84u)
/** Alias (User Manual Name) for DMA_SUSENR97.
* To use register names with standard convension, please use DMA_SUSENR97.
*/
#define DMA_SUSENR097 (DMA_SUSENR97)

/** \brief 1B88, DMA Channel 98 Suspend Enable Register */
#define DMA_SUSENR98 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B88u)
/** Alias (User Manual Name) for DMA_SUSENR98.
* To use register names with standard convension, please use DMA_SUSENR98.
*/
#define DMA_SUSENR098 (DMA_SUSENR98)

/** \brief 1B8C, DMA Channel 99 Suspend Enable Register */
#define DMA_SUSENR99 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B8Cu)
/** Alias (User Manual Name) for DMA_SUSENR99.
* To use register names with standard convension, please use DMA_SUSENR99.
*/
#define DMA_SUSENR099 (DMA_SUSENR99)

/** \brief 1B90, DMA Channel 100 Suspend Enable Register */
#define DMA_SUSENR100 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B90u)

/** \brief 1B94, DMA Channel 101 Suspend Enable Register */
#define DMA_SUSENR101 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B94u)

/** \brief 1B98, DMA Channel 102 Suspend Enable Register */
#define DMA_SUSENR102 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B98u)

/** \brief 1B9C, DMA Channel 103 Suspend Enable Register */
#define DMA_SUSENR103 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B9Cu)

/** \brief 1BA0, DMA Channel 104 Suspend Enable Register */
#define DMA_SUSENR104 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BA0u)

/** \brief 1BA4, DMA Channel 105 Suspend Enable Register */
#define DMA_SUSENR105 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BA4u)

/** \brief 1BA8, DMA Channel 106 Suspend Enable Register */
#define DMA_SUSENR106 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BA8u)

/** \brief 1BAC, DMA Channel 107 Suspend Enable Register */
#define DMA_SUSENR107 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BACu)

/** \brief 1BB0, DMA Channel 108 Suspend Enable Register */
#define DMA_SUSENR108 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BB0u)

/** \brief 1BB4, DMA Channel 109 Suspend Enable Register */
#define DMA_SUSENR109 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BB4u)

/** \brief 1BB8, DMA Channel 110 Suspend Enable Register */
#define DMA_SUSENR110 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BB8u)

/** \brief 1BBC, DMA Channel 111 Suspend Enable Register */
#define DMA_SUSENR111 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BBCu)

/** \brief 1BC0, DMA Channel 112 Suspend Enable Register */
#define DMA_SUSENR112 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BC0u)

/** \brief 1BC4, DMA Channel 113 Suspend Enable Register */
#define DMA_SUSENR113 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BC4u)

/** \brief 1BC8, DMA Channel 114 Suspend Enable Register */
#define DMA_SUSENR114 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BC8u)

/** \brief 1BCC, DMA Channel 115 Suspend Enable Register */
#define DMA_SUSENR115 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BCCu)

/** \brief 1BD0, DMA Channel 116 Suspend Enable Register */
#define DMA_SUSENR116 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BD0u)

/** \brief 1BD4, DMA Channel 117 Suspend Enable Register */
#define DMA_SUSENR117 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BD4u)

/** \brief 1BD8, DMA Channel 118 Suspend Enable Register */
#define DMA_SUSENR118 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BD8u)

/** \brief 1BDC, DMA Channel 119 Suspend Enable Register */
#define DMA_SUSENR119 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BDCu)

/** \brief 1BE0, DMA Channel 120 Suspend Enable Register */
#define DMA_SUSENR120 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BE0u)

/** \brief 1BE4, DMA Channel 121 Suspend Enable Register */
#define DMA_SUSENR121 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BE4u)

/** \brief 1BE8, DMA Channel 122 Suspend Enable Register */
#define DMA_SUSENR122 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BE8u)

/** \brief 1BEC, DMA Channel 123 Suspend Enable Register */
#define DMA_SUSENR123 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BECu)

/** \brief 1BF0, DMA Channel 124 Suspend Enable Register */
#define DMA_SUSENR124 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BF0u)

/** \brief 1BF4, DMA Channel 125 Suspend Enable Register */
#define DMA_SUSENR125 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BF4u)

/** \brief 1BF8, DMA Channel 126 Suspend Enable Register */
#define DMA_SUSENR126 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BF8u)

/** \brief 1BFC, DMA Channel 127 Suspend Enable Register */
#define DMA_SUSENR127 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BFCu)

