HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxDma_reg.h
/** \brief 1D68, DMA Channel 90 Suspend Acknowledge Register */
#define DMA_SUSACR90 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D68u)
/** Alias (User Manual Name) for DMA_SUSACR90.
* To use register names with standard convension, please use DMA_SUSACR90.
*/
#define DMA_SUSACR090 (DMA_SUSACR90)

/** \brief 1D6C, DMA Channel 91 Suspend Acknowledge Register */
#define DMA_SUSACR91 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D6Cu)
/** Alias (User Manual Name) for DMA_SUSACR91.
* To use register names with standard convension, please use DMA_SUSACR91.
*/
#define DMA_SUSACR091 (DMA_SUSACR91)

/** \brief 1D70, DMA Channel 92 Suspend Acknowledge Register */
#define DMA_SUSACR92 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D70u)
/** Alias (User Manual Name) for DMA_SUSACR92.
* To use register names with standard convension, please use DMA_SUSACR92.
*/
#define DMA_SUSACR092 (DMA_SUSACR92)

/** \brief 1D74, DMA Channel 93 Suspend Acknowledge Register */
#define DMA_SUSACR93 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D74u)
/** Alias (User Manual Name) for DMA_SUSACR93.
* To use register names with standard convension, please use DMA_SUSACR93.
*/
#define DMA_SUSACR093 (DMA_SUSACR93)

/** \brief 1D78, DMA Channel 94 Suspend Acknowledge Register */
#define DMA_SUSACR94 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D78u)
/** Alias (User Manual Name) for DMA_SUSACR94.
* To use register names with standard convension, please use DMA_SUSACR94.
*/
#define DMA_SUSACR094 (DMA_SUSACR94)

/** \brief 1D7C, DMA Channel 95 Suspend Acknowledge Register */
#define DMA_SUSACR95 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D7Cu)
/** Alias (User Manual Name) for DMA_SUSACR95.
* To use register names with standard convension, please use DMA_SUSACR95.
*/
#define DMA_SUSACR095 (DMA_SUSACR95)

/** \brief 1D80, DMA Channel 96 Suspend Acknowledge Register */
#define DMA_SUSACR96 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D80u)
/** Alias (User Manual Name) for DMA_SUSACR96.
* To use register names with standard convension, please use DMA_SUSACR96.
*/
#define DMA_SUSACR096 (DMA_SUSACR96)

/** \brief 1D84, DMA Channel 97 Suspend Acknowledge Register */
#define DMA_SUSACR97 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D84u)
/** Alias (User Manual Name) for DMA_SUSACR97.
* To use register names with standard convension, please use DMA_SUSACR97.
*/
#define DMA_SUSACR097 (DMA_SUSACR97)

/** \brief 1D88, DMA Channel 98 Suspend Acknowledge Register */
#define DMA_SUSACR98 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D88u)
/** Alias (User Manual Name) for DMA_SUSACR98.
* To use register names with standard convension, please use DMA_SUSACR98.
*/
#define DMA_SUSACR098 (DMA_SUSACR98)

/** \brief 1D8C, DMA Channel 99 Suspend Acknowledge Register */
#define DMA_SUSACR99 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D8Cu)
/** Alias (User Manual Name) for DMA_SUSACR99.
* To use register names with standard convension, please use DMA_SUSACR99.
*/
#define DMA_SUSACR099 (DMA_SUSACR99)

/** \brief 1D90, DMA Channel 100 Suspend Acknowledge Register */
#define DMA_SUSACR100 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D90u)

/** \brief 1D94, DMA Channel 101 Suspend Acknowledge Register */
#define DMA_SUSACR101 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D94u)

/** \brief 1D98, DMA Channel 102 Suspend Acknowledge Register */
#define DMA_SUSACR102 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D98u)

/** \brief 1D9C, DMA Channel 103 Suspend Acknowledge Register */
#define DMA_SUSACR103 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D9Cu)

/** \brief 1DA0, DMA Channel 104 Suspend Acknowledge Register */
#define DMA_SUSACR104 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DA0u)

/** \brief 1DA4, DMA Channel 105 Suspend Acknowledge Register */
#define DMA_SUSACR105 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DA4u)

/** \brief 1DA8, DMA Channel 106 Suspend Acknowledge Register */
#define DMA_SUSACR106 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DA8u)

/** \brief 1DAC, DMA Channel 107 Suspend Acknowledge Register */
#define DMA_SUSACR107 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DACu)

/** \brief 1DB0, DMA Channel 108 Suspend Acknowledge Register */
#define DMA_SUSACR108 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DB0u)

/** \brief 1DB4, DMA Channel 109 Suspend Acknowledge Register */
#define DMA_SUSACR109 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DB4u)

/** \brief 1DB8, DMA Channel 110 Suspend Acknowledge Register */
#define DMA_SUSACR110 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DB8u)

/** \brief 1DBC, DMA Channel 111 Suspend Acknowledge Register */
#define DMA_SUSACR111 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DBCu)

/** \brief 1DC0, DMA Channel 112 Suspend Acknowledge Register */
#define DMA_SUSACR112 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DC0u)

/** \brief 1DC4, DMA Channel 113 Suspend Acknowledge Register */
#define DMA_SUSACR113 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DC4u)

/** \brief 1DC8, DMA Channel 114 Suspend Acknowledge Register */
#define DMA_SUSACR114 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DC8u)

/** \brief 1DCC, DMA Channel 115 Suspend Acknowledge Register */
#define DMA_SUSACR115 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DCCu)

/** \brief 1DD0, DMA Channel 116 Suspend Acknowledge Register */
#define DMA_SUSACR116 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DD0u)

/** \brief 1DD4, DMA Channel 117 Suspend Acknowledge Register */
#define DMA_SUSACR117 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DD4u)

/** \brief 1DD8, DMA Channel 118 Suspend Acknowledge Register */
#define DMA_SUSACR118 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011DD8u)

