HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxDma_reg.h
/** \brief 2B34, DMARAM Channel 89 Configuration Register */
#define DMA_CH89_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B34u)
/** Alias (User Manual Name) for DMA_CH89_CHCFGR.
* To use register names with standard convension, please use DMA_CH89_CHCFGR.
*/
#define DMA_CHCFGR089 (DMA_CH89_CHCFGR)

/** \brief 2B38, DMARAM Channel 89 Shadow Address Register */
#define DMA_CH89_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B38u)
/** Alias (User Manual Name) for DMA_CH89_SHADR.
* To use register names with standard convension, please use DMA_CH89_SHADR.
*/
#define DMA_SHADR089 (DMA_CH89_SHADR)

/** \brief 2B3C, DMARAM Channel 89 Control and Status Register */
#define DMA_CH89_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B3Cu)
/** Alias (User Manual Name) for DMA_CH89_CHCSR.
* To use register names with standard convension, please use DMA_CH89_CHCSR.
*/
#define DMA_CHCSR089 (DMA_CH89_CHCSR)

/** \brief 2B40, DMARAM Channel 90 Read Data CRC Register */
#define DMA_CH90_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B40u)
/** Alias (User Manual Name) for DMA_CH90_RDCRCR.
* To use register names with standard convension, please use DMA_CH90_RDCRCR.
*/
#define DMA_RDCRCR090 (DMA_CH90_RDCRCR)

/** \brief 2B44, DMARAM Channel 90 Source and Destination Address CRC Register */
#define DMA_CH90_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B44u)
/** Alias (User Manual Name) for DMA_CH90_SDCRCR.
* To use register names with standard convension, please use DMA_CH90_SDCRCR.
*/
#define DMA_SDCRCR090 (DMA_CH90_SDCRCR)

/** \brief 2B48, DMARAM Channel 90 Source Address Register */
#define DMA_CH90_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B48u)
/** Alias (User Manual Name) for DMA_CH90_SADR.
* To use register names with standard convension, please use DMA_CH90_SADR.
*/
#define DMA_SADR090 (DMA_CH90_SADR)

/** \brief 2B4C, DMARAM Channel 90 Destination Address Register */
#define DMA_CH90_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B4Cu)
/** Alias (User Manual Name) for DMA_CH90_DADR.
* To use register names with standard convension, please use DMA_CH90_DADR.
*/
#define DMA_DADR090 (DMA_CH90_DADR)

/** \brief 2B50, DMARAM Channel 90 Address and Interrupt Control Register */
#define DMA_CH90_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B50u)
/** Alias (User Manual Name) for DMA_CH90_ADICR.
* To use register names with standard convension, please use DMA_CH90_ADICR.
*/
#define DMA_ADICR090 (DMA_CH90_ADICR)

/** \brief 2B54, DMARAM Channel 90 Configuration Register */
#define DMA_CH90_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B54u)
/** Alias (User Manual Name) for DMA_CH90_CHCFGR.
* To use register names with standard convension, please use DMA_CH90_CHCFGR.
*/
#define DMA_CHCFGR090 (DMA_CH90_CHCFGR)

/** \brief 2B58, DMARAM Channel 90 Shadow Address Register */
#define DMA_CH90_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B58u)
/** Alias (User Manual Name) for DMA_CH90_SHADR.
* To use register names with standard convension, please use DMA_CH90_SHADR.
*/
#define DMA_SHADR090 (DMA_CH90_SHADR)

/** \brief 2B5C, DMARAM Channel 90 Control and Status Register */
#define DMA_CH90_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B5Cu)
/** Alias (User Manual Name) for DMA_CH90_CHCSR.
* To use register names with standard convension, please use DMA_CH90_CHCSR.
*/
#define DMA_CHCSR090 (DMA_CH90_CHCSR)

/** \brief 2B60, DMARAM Channel 91 Read Data CRC Register */
#define DMA_CH91_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B60u)
/** Alias (User Manual Name) for DMA_CH91_RDCRCR.
* To use register names with standard convension, please use DMA_CH91_RDCRCR.
*/
#define DMA_RDCRCR091 (DMA_CH91_RDCRCR)

/** \brief 2B64, DMARAM Channel 91 Source and Destination Address CRC Register */
#define DMA_CH91_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B64u)
/** Alias (User Manual Name) for DMA_CH91_SDCRCR.
* To use register names with standard convension, please use DMA_CH91_SDCRCR.
*/
#define DMA_SDCRCR091 (DMA_CH91_SDCRCR)

/** \brief 2B68, DMARAM Channel 91 Source Address Register */
#define DMA_CH91_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B68u)
/** Alias (User Manual Name) for DMA_CH91_SADR.
* To use register names with standard convension, please use DMA_CH91_SADR.
*/
#define DMA_SADR091 (DMA_CH91_SADR)

/** \brief 2B6C, DMARAM Channel 91 Destination Address Register */
#define DMA_CH91_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B6Cu)
/** Alias (User Manual Name) for DMA_CH91_DADR.
* To use register names with standard convension, please use DMA_CH91_DADR.
*/
#define DMA_DADR091 (DMA_CH91_DADR)

/** \brief 2B70, DMARAM Channel 91 Address and Interrupt Control Register */
#define DMA_CH91_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B70u)
/** Alias (User Manual Name) for DMA_CH91_ADICR.
* To use register names with standard convension, please use DMA_CH91_ADICR.
*/
#define DMA_ADICR091 (DMA_CH91_ADICR)

/** \brief 2B74, DMARAM Channel 91 Configuration Register */
#define DMA_CH91_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B74u)
/** Alias (User Manual Name) for DMA_CH91_CHCFGR.
* To use register names with standard convension, please use DMA_CH91_CHCFGR.
*/
#define DMA_CHCFGR091 (DMA_CH91_CHCFGR)

/** \brief 2B78, DMARAM Channel 91 Shadow Address Register */
#define DMA_CH91_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B78u)
/** Alias (User Manual Name) for DMA_CH91_SHADR.
* To use register names with standard convension, please use DMA_CH91_SHADR.
*/
#define DMA_SHADR091 (DMA_CH91_SHADR)

/** \brief 2B7C, DMARAM Channel 91 Control and Status Register */
#define DMA_CH91_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B7Cu)
/** Alias (User Manual Name) for DMA_CH91_CHCSR.
* To use register names with standard convension, please use DMA_CH91_CHCSR.
*/
#define DMA_CHCSR091 (DMA_CH91_CHCSR)

/** \brief 2B80, DMARAM Channel 92 Read Data CRC Register */
#define DMA_CH92_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B80u)
/** Alias (User Manual Name) for DMA_CH92_RDCRCR.
* To use register names with standard convension, please use DMA_CH92_RDCRCR.
*/
#define DMA_RDCRCR092 (DMA_CH92_RDCRCR)

/** \brief 2B84, DMARAM Channel 92 Source and Destination Address CRC Register */
#define DMA_CH92_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B84u)
/** Alias (User Manual Name) for DMA_CH92_SDCRCR.
* To use register names with standard convension, please use DMA_CH92_SDCRCR.
*/
#define DMA_SDCRCR092 (DMA_CH92_SDCRCR)

/** \brief 2B88, DMARAM Channel 92 Source Address Register */
#define DMA_CH92_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B88u)
/** Alias (User Manual Name) for DMA_CH92_SADR.
* To use register names with standard convension, please use DMA_CH92_SADR.
*/
#define DMA_SADR092 (DMA_CH92_SADR)

