HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxDma_reg.h
/** \brief 2DE4, DMARAM Channel 111 Source and Destination Address CRC Register */
#define DMA_CH111_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012DE4u)
/** Alias (User Manual Name) for DMA_CH111_SDCRCR.
* To use register names with standard convension, please use DMA_CH111_SDCRCR.
*/
#define DMA_SDCRCR111 (DMA_CH111_SDCRCR)

/** \brief 2DE8, DMARAM Channel 111 Source Address Register */
#define DMA_CH111_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012DE8u)
/** Alias (User Manual Name) for DMA_CH111_SADR.
* To use register names with standard convension, please use DMA_CH111_SADR.
*/
#define DMA_SADR111 (DMA_CH111_SADR)

/** \brief 2DEC, DMARAM Channel 111 Destination Address Register */
#define DMA_CH111_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012DECu)
/** Alias (User Manual Name) for DMA_CH111_DADR.
* To use register names with standard convension, please use DMA_CH111_DADR.
*/
#define DMA_DADR111 (DMA_CH111_DADR)

/** \brief 2DF0, DMARAM Channel 111 Address and Interrupt Control Register */
#define DMA_CH111_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012DF0u)
/** Alias (User Manual Name) for DMA_CH111_ADICR.
* To use register names with standard convension, please use DMA_CH111_ADICR.
*/
#define DMA_ADICR111 (DMA_CH111_ADICR)

/** \brief 2DF4, DMARAM Channel 111 Configuration Register */
#define DMA_CH111_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012DF4u)
/** Alias (User Manual Name) for DMA_CH111_CHCFGR.
* To use register names with standard convension, please use DMA_CH111_CHCFGR.
*/
#define DMA_CHCFGR111 (DMA_CH111_CHCFGR)

/** \brief 2DF8, DMARAM Channel 111 Shadow Address Register */
#define DMA_CH111_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012DF8u)
/** Alias (User Manual Name) for DMA_CH111_SHADR.
* To use register names with standard convension, please use DMA_CH111_SHADR.
*/
#define DMA_SHADR111 (DMA_CH111_SHADR)

/** \brief 2DFC, DMARAM Channel 111 Control and Status Register */
#define DMA_CH111_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012DFCu)
/** Alias (User Manual Name) for DMA_CH111_CHCSR.
* To use register names with standard convension, please use DMA_CH111_CHCSR.
*/
#define DMA_CHCSR111 (DMA_CH111_CHCSR)

/** \brief 2E00, DMARAM Channel 112 Read Data CRC Register */
#define DMA_CH112_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012E00u)
/** Alias (User Manual Name) for DMA_CH112_RDCRCR.
* To use register names with standard convension, please use DMA_CH112_RDCRCR.
*/
#define DMA_RDCRCR112 (DMA_CH112_RDCRCR)

/** \brief 2E04, DMARAM Channel 112 Source and Destination Address CRC Register */
#define DMA_CH112_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012E04u)
/** Alias (User Manual Name) for DMA_CH112_SDCRCR.
* To use register names with standard convension, please use DMA_CH112_SDCRCR.
*/
#define DMA_SDCRCR112 (DMA_CH112_SDCRCR)

/** \brief 2E08, DMARAM Channel 112 Source Address Register */
#define DMA_CH112_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012E08u)
/** Alias (User Manual Name) for DMA_CH112_SADR.
* To use register names with standard convension, please use DMA_CH112_SADR.
*/
#define DMA_SADR112 (DMA_CH112_SADR)

/** \brief 2E0C, DMARAM Channel 112 Destination Address Register */
#define DMA_CH112_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012E0Cu)
/** Alias (User Manual Name) for DMA_CH112_DADR.
* To use register names with standard convension, please use DMA_CH112_DADR.
*/
#define DMA_DADR112 (DMA_CH112_DADR)

/** \brief 2E10, DMARAM Channel 112 Address and Interrupt Control Register */
#define DMA_CH112_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012E10u)
/** Alias (User Manual Name) for DMA_CH112_ADICR.
* To use register names with standard convension, please use DMA_CH112_ADICR.
*/
#define DMA_ADICR112 (DMA_CH112_ADICR)

/** \brief 2E14, DMARAM Channel 112 Configuration Register */
#define DMA_CH112_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012E14u)
/** Alias (User Manual Name) for DMA_CH112_CHCFGR.
* To use register names with standard convension, please use DMA_CH112_CHCFGR.
*/
#define DMA_CHCFGR112 (DMA_CH112_CHCFGR)

/** \brief 2E18, DMARAM Channel 112 Shadow Address Register */
#define DMA_CH112_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012E18u)
/** Alias (User Manual Name) for DMA_CH112_SHADR.
* To use register names with standard convension, please use DMA_CH112_SHADR.
*/
#define DMA_SHADR112 (DMA_CH112_SHADR)

/** \brief 2E1C, DMARAM Channel 112 Control and Status Register */
#define DMA_CH112_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012E1Cu)
/** Alias (User Manual Name) for DMA_CH112_CHCSR.
* To use register names with standard convension, please use DMA_CH112_CHCSR.
*/
#define DMA_CHCSR112 (DMA_CH112_CHCSR)

/** \brief 2E20, DMARAM Channel 113 Read Data CRC Register */
#define DMA_CH113_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012E20u)
/** Alias (User Manual Name) for DMA_CH113_RDCRCR.
* To use register names with standard convension, please use DMA_CH113_RDCRCR.
*/
#define DMA_RDCRCR113 (DMA_CH113_RDCRCR)

/** \brief 2E24, DMARAM Channel 113 Source and Destination Address CRC Register */
#define DMA_CH113_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012E24u)
/** Alias (User Manual Name) for DMA_CH113_SDCRCR.
* To use register names with standard convension, please use DMA_CH113_SDCRCR.
*/
#define DMA_SDCRCR113 (DMA_CH113_SDCRCR)

/** \brief 2E28, DMARAM Channel 113 Source Address Register */
#define DMA_CH113_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012E28u)
/** Alias (User Manual Name) for DMA_CH113_SADR.
* To use register names with standard convension, please use DMA_CH113_SADR.
*/
#define DMA_SADR113 (DMA_CH113_SADR)

/** \brief 2E2C, DMARAM Channel 113 Destination Address Register */
#define DMA_CH113_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012E2Cu)
/** Alias (User Manual Name) for DMA_CH113_DADR.
* To use register names with standard convension, please use DMA_CH113_DADR.
*/
#define DMA_DADR113 (DMA_CH113_DADR)

/** \brief 2E30, DMARAM Channel 113 Address and Interrupt Control Register */
#define DMA_CH113_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012E30u)
/** Alias (User Manual Name) for DMA_CH113_ADICR.
* To use register names with standard convension, please use DMA_CH113_ADICR.
*/
#define DMA_ADICR113 (DMA_CH113_ADICR)

/** \brief 2E34, DMARAM Channel 113 Configuration Register */
#define DMA_CH113_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012E34u)
/** Alias (User Manual Name) for DMA_CH113_CHCFGR.
* To use register names with standard convension, please use DMA_CH113_CHCFGR.
*/
#define DMA_CHCFGR113 (DMA_CH113_CHCFGR)

/** \brief 2E38, DMARAM Channel 113 Shadow Address Register */
#define DMA_CH113_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012E38u)
/** Alias (User Manual Name) for DMA_CH113_SHADR.
* To use register names with standard convension, please use DMA_CH113_SHADR.
*/
#define DMA_SHADR113 (DMA_CH113_SHADR)

